Enums/ДниНедели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ДниНедели</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Понедельник</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Вторник</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Среда</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Четверг</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пятница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Суббота</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воскресенье</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ДниНедели/Ext/ManagerModule.bsl
Функция НомерДняНедели(ДеньНедели) Экспорт
	
	// Метаданные не используются намеренно.
	Если (ДеньНедели = Перечисления.ДниНедели.Понедельник) Тогда
		Возврат 1;
	КонецЕсли; 
	Если (ДеньНедели = Перечисления.ДниНедели.Вторник) Тогда
		Возврат 2;
	КонецЕсли; 
	Если (ДеньНедели = Перечисления.ДниНедели.Среда) Тогда
		Возврат 3;
	КонецЕсли; 
	Если (ДеньНедели = Перечисления.ДниНедели.Четверг) Тогда
		Возврат 4;
	КонецЕсли; 
	Если (ДеньНедели = Перечисления.ДниНедели.Пятница) Тогда
		Возврат 5;
	КонецЕсли; 
	Если (ДеньНедели = Перечисления.ДниНедели.Суббота) Тогда
		Возврат 6;
	КонецЕсли; 
	Если (ДеньНедели = Перечисления.ДниНедели.Воскресенье) Тогда
		Возврат 7;
	КонецЕсли; 

	Возврат 0;

КонецФункции // НомерДняНедели()
